// Level 01
const Level1 = [
    "සෑම හොඳ හසිරීමකටම කුඩා ත්‍යාගයක් ලබා දෙන්න.",
    "එය නොසලකා හැරීමෙන් නිෂේධාත්මක හැසිරීම අධෛර්යමත් කරන්න.",
    "අවධානය වෙනතකට යොමු නොවී පිටව යාමෙන් තොරව සම්පූර්ණ විස්තරාත්මක පින්තූරයක් (වයසට සුදුසු) වර්ණ ගන්වන්න.",
    "දරුවා නින්දට යන විට කතන්දර කියන්න, කතාව අතරතුර කුඩා ප්රශ්න අසන්න.",
    "සීමිත කාල සීමාවක් සඳහා දරුවාගේ තිර කාලය අඩු කරන්න (දිනකට උපරිම විනාඩි 30).",
    "දරුවාගේ කෑම වේල වර්ණවත්ව ලබා දෙන්න.",
    "දෑත් භාවිතයෙන් දරුවාට තනිවම ආහාර ගැනීමට සලස්වන්න.",
    "ආහාර පිසීමේදී දරුවාගේ උපකාරය ලබා ගන්න.",
    "දරුවාට ඔහු/ඇය දවසේ කළ යහපත දරුවාගෙන් ලිවීමට/ඇසීමට ඉඩ දෙන්න.",
    "නිතිපතා එදිනෙදා දේවල් ගැන දරුවා සමඟ කතා කරන්න.",
    "ඔහු/ඇය කැමති නැති අය සමඟ සම්බන්ධ වීමට දරුවාට බල නොකරන්න.",
    "මිනිසුන් ඉදිරියේ ගායනය / නැටුම් ඉදිරිපත් කිරීමට දරුවාට නොපවසන්න.",
    "දරුවා කරන කුඩා දෙයක් නතර කළ විට ඔහුට කුඩා ත්‍යාගයක් දෙන්න.",
    "දරුවා කළ නරක දෙයක් නතර කළ විට ඔහුට කුඩා ත්‍යාගයක් දෙන්න.",
    "දරුවා කරන කුඩා දෙයක් පවා අගය කරන්න.",
    "දරුවාගෙන් දේවල් ගැන ඇස්තමේන්තු විමසන්න."
  ];
  
  // Level 02
  const Level2 = [
    "සෑම හොඳ හසිරීමකටම කුඩා ත්‍යාගයක් ලබා දෙන්න.",
    "විවේචනාත්මක නරක හැසිරීමක් පෙන්නුම් කරන විට ලබා දී ඇති යම් කුඩා වරප්‍රසාදයක් ඉවත් කරන්න.",
    "මවගේ උදව් නොමැතිව පාසලට යාමට සූදානම් වීමට උගන්වන්න.",
    "මව වැඩ කරන අතරතුර කාලයකට තනිවම සෙල්ලම් කිරීමට සලස්වන්න.",
    "සීමිත කාල සීමාවක් සඳහා දරුවාගේ තිර කාලය අඩු කරන්න (දිනකට උපරිම විනාඩි 30).",
    "දරුවාගේ කෑම වේල වර්ණවත්ව ලබා දෙන්න.",
    "දෑත් භාවිතයෙන් දරුවාට තනිවම ආහාර ගැනීමට සලස්වන්න.",
    "දරුවාට ඃංවෘත ස්ථානයක සෙල්ලම් කිරීමට ඉඩ දෙන්න.",
    "සෑම දින 2කටම පසු එකම සංගීත පථය/ගීතය දරුවාට ඇසීමට දෙන්න.",
    "දරුවාට ඔහු/ඇය දවසේ කළ යහපත දරුවාගෙන් ලිවීමට/ඇසීමට ඉඩ දෙන්න.",
    "නිතිපතා එදිනෙදා දේවල් ගැන දරුවා සමඟ කතා කරන්න.",
    "ඔහු/ඇය කැමති නැති අය සමඟ සම්බන්ධ වීමට දරුවාට බල නොකරන්න.",
    "මිනිසුන් ඉදිරියේ ගායනය / නැටුම් ඉදිරිපත් කිරීමට දරුවාට නොපවසන්න."
  ];
  
  // Exporting the instructions
  export { Level1, Level2 };
  