export const ApooruNuwana = [
  {
    question: "1. අහසේ රටා මවමින් ඉගිලුනේ කවුද ?",
    options: [" මී මැස ්සන් රංචුවක්", "උක ුස්සෙක්", "කුරුලු රංචුවක්"],
    correctAnswerIndex: 2, // Index of the correct answer in the options array
  },
  {
    question: "2. කතාවේ සිටින ළමයාගේ නම මොකක්ද?",
    options: ["පවනි", "තරිඳු", "කවිඳු"],
    correctAnswerIndex: 1,
  },
  {
    question: "3. තරිඳු කරන්නට පටන් ගත්තේ කුමක්ද?",
    options: [
      "රංචුවේ සිටින කුරුල්ලන් ගනන් කිරීම",
      "කුරුල්ලන්ට කැටපෝලයෙන් විදීම",
      "පළතුරු කැඩීම",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "4. තරිඳුට කුරුල්ලන් ගණන වරදින්නේ ඇය ි?",
    options: [
      "කුරුල්ලන්ගේ දාංගලේ නිසා",
      "තරිඳු ගණන් කරන්නට දන්නේ නැති නිසා",
      "තරිඳුගෙ ් ඇස් පෙනීම දුර්වල නිසා",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "5. ටික වෙලාවක් කල්පනා කර කර සිටි තරිඳු ඊලඟට කලේ කුමක්ද?",
    options: ["කෑ ගැසීම", "ඇඬීම", "ගෙ ් ඇතුලට දිවීම"],
    correctAnswerIndex: 2,
  },
  {
    question: "6. තරිඳු අම්මාගෙන් ඇස ුවේ කුමක්ද?",
    options: [
      "අම්මේ කෑම ලෑස්තිද?",
      "අම්මේ මේ කුරුල්ලන්ගෙ ් නම මොකක්ද?",
      "අම්මේ අයියා කොහෙද?",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "7. පියාඹමින් සිටි කුරුල්ලන්ගෙ ් නම කුමක්ද?",
    options: ["කොණ්ඩ කුරුල්ලන්", "වී කුරුල්ලන්", "කොබෙය ියන්"],
    correctAnswerIndex: 1,
  },
  {
    question: "8. කුරුල්ලන් ගැන විස්තර දැනගත් තරිඳුට උවමනා වූයෙ ් කුමක්ද?",
    options: [
      "කුරුල්ලන් ගැන ලියැවුනු කතාවක් මිලදී ගන්න",
      "කුරුල්ලන් අල්ලා ගන්න",
      "කුරුල්ලන් ගැන කතාවක් ලියන්න",
    ],
    correctAnswerIndex: 2,
  },
  {
    question: "9. තරිඳු කුරුලු පිහාටුවක් ලබා ගන්න කලේ කුමක්ද?",
    options: [
      "වී අහුරක් අරගෙන උඩට විස ි කලා",
      "කුරුල්ලන්ට ගල් ගැසුවා",
      "තාත්තාට කතා කලා",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "10. තරිඳුට කුරුලු පිහාටු ගොඩක් හම්බුනේ කොතනින්ද?",
    options: ["බිමින්", "වතුර බේසමෙන්", "ගහක් උඩින"],
    correctAnswerIndex: 1,
  },
];

export const NapuruAliya = [
  {
    question: "1. අලි රාල කැලේ මැදින් ගමනක් යන විට දුටුවේ කුමක්ද?",
    options: ["ගස් බෙනයක්", "මී වදයක්", "කුරුලූ කූඩ ුවක්"],
    correctAnswerIndex: 1, // Index of the correct answer in the options array
  },
  {
    question: "2. මී වදයක් දැකපු අලි රාල සිතුවේ මොනවාද?",
    options: ["මී වදය කඩලා විනාශ කරන්න", "මී පැණි කන්න", "දුවන්න"],
    correctAnswerIndex: 0,
  },
  {
    question: "3. අලි රාල මී වදය කඩන්න හදනකොටම ඉන් එලියට ආවේ කවුද?",
    options: ["මී මැස ි රැජිණ", "මී මැස ්සන් රංචුවක්", "පුංචි මී මැස්සෙක්"],
    correctAnswerIndex: 2,
  },
  {
    question:
      "4. මී මැස ්සන්ගේ ග ුමු ග ුමු නාදය කන්දොස්ක ිරියාවක් බව කීවේ කවුද?",
    options: ["දඩයක්කාරයා", "පුංචි මී මැස ්සා", "නපුරු අලියා"],
    correctAnswerIndex: 2,
  },
  {
    question: "5. පුංචි මී මැස ්සා අලි රාලගෙන් පලි ගැනීමට සිත ුවේ ඇය ි?",
    options: [
      "අල ි රාල මී පැණි කෑ නිසා",
      "අලි රාල මී වදය විනාශ කල නිසා",
      "අලි රාල පුංචි මී මැස්සට පහර දුන් නිසා",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "6. පුංචි මී මැස්සා මුණගැසීමට ග ියේ කවුරුන්ද?",
    options: ["අල ි රංචුවේ නායකයා ", "කැලේ රජතුමා", "මී මැස ි රැජිණ"],
    correctAnswerIndex: 2, // Index of the correct answer in the options array
  },
  {
    question:
      "7. අලි රාලගේ ඇඟට විදල වැඩක් නෑ” යැය ි මී මැසි රැජිණ කියන්නේ ඇයි?",
    options: [
      "අල ි රාලගේ හම හය ිය නිසා",
      "අලි රාල විශාල නිසා",
      "මී මැස ්සන් ගණන අඩ ු නිසා",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "8. පුංචි මී මැස්සා ආයෙමත් අලි රාල මුණගැහෙන්න ග ියෙ ් කා එක ්කද?",
    options: ["මී මැස ි රැජිණ සමග", "අනිත් මී මැස්සන් සමග", "සිංහයා සමග"],
    correctAnswerIndex: 1,
  },
  {
    question: "9. මී මැස ්සන් වේගයෙන් පියාඹලා ඇවිත් රිංග ුවේ කොතැනටද?",
    options: [
      "අල ි රාලගේ කටට",
      "ගස් බෙනයකට",
      "අලි රාලගෙ ් හොඬවැලට සහ කන් දෙකට",
    ],
    correctAnswerIndex: 2,
  },
  {
    question:
      "10. ”මං ආයෙ ් කවදාවත් නපුරු වැඩ කරන්නේ නෑ” යනුවෙන් කෑ ගැසුවේ කවුරුන්ද?",
    options: ["අල ි රාල", "පුංචි මී මැස ්සා", "මී මැස ි රැජිණ"],
    correctAnswerIndex: 0,
  },
];
export const NidigathKumariya = [
  {
    question: "1. රජතුමාට සහ රජ බිසවට දූ කුමරියන් කී දෙනෙකු ලැබුනේද?",
    options: ["1", "2", "0"],
    correctAnswerIndex: 0, // Index of the correct answer in the options array
  },
  {
    question: "2. දූ කුමරියට ආශිර්වාද කිරීමට රජතුමා විසින් ආරාධනා කලේ කාටද?",
    options: ["නෑදෑයන්ට", "රට වැසියන්ට", "සුරංගනාවියන්ට"],
    correctAnswerIndex: 1,
  },
  {
    question: "3. නපුරු සුරංගනාවිය රජතුමා සමග කෝපයට පත් වූයේ ඇය ි?",
    options: [
      "රජතුමා ඇයට ආරාධනා නොකල නිසා",
      "ඇයට හොඳ ඇඳුමක් නොතිබුන නිසා",
      "අනිත් අය ඇයට අකමැති නිසා",
    ],
    correctAnswerIndex: 2,
  },
  {
    question: "4. නපුරු සුරංගනාවිය විසින් පුංචි කුමාරියට කල ශාපය කුමක්ද?",
    options: [
      "කුමාරිය වයස අවුරුදු 15 දී ඇණයක් ඇනී මිය යන බව",
      "කුමාරිය වය ්ස අවුරුදු 15 දී ගොලූ වන බව",
      "කුමාරිය සදාකල් නින්දේම පසු වන බව",
    ],
    correctAnswerIndex: 1,
  },
  {
    question:
      "5. අවසානයට ආශිර්වාද කිරීමට පැමිණි හොඳ සුරංගනාවිය, කුමරියට පැවසූයේ කුමක්ද?",
    options: [
      "වයස අවුරුදු 15 දී කුමරිය මිය යන බව",
      "වයස අවුරුදු 15 දී කුමරිය අවුරුදු 100ක නින්දකට වැටෙන බව",
      "කුමරියට කිසිවක් සිදු නොවන බව",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "6. කුමාරිකාව නින්දෙන් ඇහැරෙන්නේ කුමක් සිදු වන විට ද?",
    options: [
      "රජතුමාගෙ ් මරණය සිදු වන විට",
      "ලස්සන කුමාරයෙකු ඇය සමග අතිනත ගැනීමට සූදානම් වන විට",
      "නපුරු සුරංගනාව මිය යන විට",
    ],
    correctAnswerIndex: 0, // Index of the correct answer in the options array
  },
  {
    question:
      "7. කුමාරිකාව නින්දට වැටී පැය කිහිපයක් යන විට සිදු වූයෙ ් කුමක්ද?",
    options: [
      "වටපිටාව අඳුරු වීම",
      "නපුරු සුරංගනාව නින්දට වැටීම",
      "රජ වාසලේ සියල්ලෝම නින්දට වැටීම",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "8. රජ වාසල නොපෙනී යන ලෙස වැස ී ගියේ මොනවාය ින්ද?",
    options: ["කටු වැල් සහ කටු පඳුරු වල ින්", "ගස් වලින්", "වලාකුලූ වලින්"],
    correctAnswerIndex: 2,
  },
  {
    question: "9. අවුරුදු 100කට පසුව පැමිණ රජ වාසල එලි පෙහෙලි කලේ කවුද?",
    options: [
      "වෙනත් රටක රජ කෙනෙක්",
      "සුරංගනාවියක්",
      "ඈත ප‍්‍රදේශයකින් පැමිණි ලස්සන කුමාරයෙක්",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "10. කුමාරිකාව නින්දට පත්ව සිටියෙ ් කී වැනි කාමරයෙ ්ද?",
    options: ["තුන්වැනි කාමරයෙ ්", "සිවු වැනි කාමරයෙ ්", "තිස් වැනි කාමරයෙ ්"],
    correctAnswerIndex: 0,
  },
];
export const PanaYaama = [
  {
    question: "1. කූඹි කණ්ඩායමේ හොඳම යාලූවන් වූයෙ ් කවුද?",
    options: [
      "කලූ කූඹියෙක් සහ රතු කූඹියෙක්",
      "තැඹිලි ක ූඹියෙක් සහ කලූ කූඹියෙක් ",
      "තැඹිලි කූඹියෙක් සහ රතු කූඹියෙක්",
    ],
    correctAnswerIndex: 1, // Index of the correct answer in the options array
  },
  {
    question: "2. කූඹි යහලූවන් දෙදෙනාට සිතුනේ කුමක්ද?",
    options: ["දෙමව්පියන් සමග ඉන්න", "කණ්ඩායම සමග ඉන්න", "තනිවම ඉන්න"],
    correctAnswerIndex: 2,
  },
  {
    question: "3. කූඹි යහලූවන් දෙදෙනා ඉන්පසු තීරණය කලේ කුමක්ද?",
    options: ["කූඹි කණ්ඩායම දාලා යන්න", "රැකියාවකට යන්න", "සෙල්ලම් කරන්න"],
    correctAnswerIndex: 0,
  },
  {
    question: "4. කූඹි යහලූවන් දෙදෙනා හොඳ තැනක් හෙව්වේ ඇය ි?",
    options: ["ගෙයක් හදන්න", "සෙල්ලම් කරන්න", "කෑම කන්න"],
    correctAnswerIndex: 0,
  },
  {
    question:
      "5. කූඹි යහලූවන් දෙදෙනා තැනක් සොයමින් යනවිට එක තැනක තිබෙනවා දැක්කේ කුමක්ද?",
    options: ["ගෙයක්", "ගසක්", "හත්තක්"],
    correctAnswerIndex: 2,
  },
  {
    question: "6. කූඹි යහලූවන් දෙදෙනාට හත්ත දුටුවිට සිත ුන අදහස කුමක්ද?",
    options: ["හත්තෙන් ලස්සන ගෙදරක් හදන්න", "හත්ත ගලවලා", "හත්ත කෑමට ගන්න"],
    correctAnswerIndex: 0, // Index of the correct answer in the options array
  },
  {
    question:
      "7. කූඹි යහලූවන් දෙදෙනා කතා කරමින් ඉන්නා විට එක ්වරම සිදු වූයෙ ් කුමක්ද?",
    options: [
      "පොළව සෙලවීම",
      "වහල සෙලවෙනවා වගෙ ් ශබ්දයක් ඇසීම",
      "ගසක් කඩාගෙන වැටීම",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "8. ලොකුම ලොකු පණුවා කරන්නට සූදානමින් සිටියෙ ් කුමක්ද?",
    options: ["කූඹි යහලූවන්ට පහර දීමට", "සෙල්ලම් කිරීමට", "හතු ගෙදර කෑමට"],
    correctAnswerIndex: 2,
  },
  {
    question: "9. ”අපිව බේරගන්න” යැය ි කෑ ගැසුවේ කවුද?",
    options: ["කූඹි යහලූවන් දෙදෙනා", "ලොකු පණුවා", "කූඹි කණ්ඩායම"],
    correctAnswerIndex: 0,
  },
  {
    question:
      "10. ලොකු පණුවා කූඹි යහලූවන් දෙදෙනාගෙ ් හතු ගෙදර කෑවාට පසුව කූඹි යහලූවන් දෙදෙනාගෙ ් සහයට පැමිණියෙ ් කවුරුන්ද?",
    options: ["පණුවන් කණ්ඩායමක්", "කුරුලූ රංචුවක්", "කූඹි කණ්ඩායම"],
    correctAnswerIndex: 2,
  },
];
export const SundaraKumariyasahaMunAtaya = [
  {
    question: "1. රජතුමාට සහ රැජිණට පුත් කුමාරවරුන් කී දෙනෙක් සිටියෙ ්ද?",
    options: ["2", "1", "0"],
    correctAnswerIndex: 0, // Index of the correct answer in the options array
  },
  {
    question: "2. රජතුමා, බිසව සහ පුත් කුමාරයා උදෑසනම පිටත් වූයෙ ් කොහි යාමටද?",
    options: [
      "ඈත රාජධානියක කුමාරිකාවක් බලන්න",
      "වෙනත් රජ කෙනෙකු හමු වීමට",
      "ය ුද්ධයකට යාමට",
    ],
    correctAnswerIndex: 0,
  },
  {
    question: "3. රජතුමා, බිසව ඇත ුලූ සියලූ දෙනා දුකින් සිටියෙ ් ඇය ි?",
    options: [
      "පුත් ක ුමාරයා අසනීපෙන්",
      "ය ුද්ධයක් පරාජය වූ නිසා",
      "පුත් කුමාරයා කිසිම කුමාරිකාවකට කැමති වුනේ නැති නිසා",
    ],
    correctAnswerIndex: 2,
  },
  {
    question: "4. මහ වැස ්ස ඇද හැලෙන විට මාලිගාවේ සේවිකාව කලේ කුමක්ද?",
    options: [
      "ආහාර පිලියෙල කිරීම",
      "මාලිගාවේ ජනෙල් දොරවල් වැස ීම",
      "මාලිගාව අතුගෑම",
    ],
    correctAnswerIndex: 1,
  },
  {
    question: "5. සේවිකාව මාලිගාවේ දොර අසලට පැමිණි විට දොරට තට්ටු කලේ කවුද?",
    options: ["හොඳටම තෙමුණ කුමාරිකාවක්", "රජතුමා", "මාලිගාවට කිරි සපයන්නා"],
    correctAnswerIndex: 0,
  },
  {
    question: "6. සේවිකාව විසින් තෙමුණ කුමාරිකාව රැගෙන ග ියේ කුමක් ලඟටද?",
    options: ["කෑම මේසය ලඟට", "රැජිණ ලඟට", "උඳුන ලඟට"],
    correctAnswerIndex: 2, // Index of the correct answer in the options array
  },
  {
    question: "7. කුමාරිකාවගෙ ් රජ මාලිගාවට සිදුවී තිබුනේ කුමක්ද?",
    options: ["ය ුද්ධයකින් විනාශ වෙලා", "ග ිනිබත් වෙලා", "අතුරුදහන් වෙලා"],
    correctAnswerIndex: 1,
  },
  {
    question: "8. රජ බිසව, කුමාරිකාවගේ ඇඳේ මෙට්ටය මත තැබුවේ කුමක්ද?",
    options: ["මුං ඇටයක්", "කඩල ඇටයක්", "වෙරළු ගෙඩියක්"],
    correctAnswerIndex: 0,
  },
  {
    question: "9. මුං ඇටයට උඩින් මෙට්ට කීයක් තැබුවේද?",
    options: ["9", "7", "5"],
    correctAnswerIndex: 1,
  },
  {
    question:
      "10. පසුවදා උදෑසන කුමාරිකාව විස ින් රජ බිසවට පැවසූවේ ඇයට කුමන අපහසුතාවයක් පැවති බවද?",
    options: ["හිසේ කක්ක ුමක්", "උණ", "කොන්දේ අමාරුවක්"],
    correctAnswerIndex: 2,
  },
];
